OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf24k50.h
extern __at(0x0FB4) volatile __T3GCONbits_t T3GCONbits;

#define _T3GSS0                 0x01
#define _T3GSS1                 0x02
#define _T3GVAL                 0x04
#define _T3GGO_NOT_T3DONE       0x08
#define _T3GGO                  0x08
#define _NOT_T3DONE             0x08
#define _T3DONE                 0x08
#define _T3GGO_NOT_DONE         0x08
#define _T3GSPM                 0x10
#define _T3GTM                  0x20
#define _T3GPOL                 0x40
#define _TMR3GE                 0x80

//==============================================================================


//==============================================================================
//        ACTCON Bits

extern __at(0x0FB5) __sfr ACTCON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned ACTORS             : 1;
    unsigned                    : 1;
    unsigned ACTLOCK            : 1;
    unsigned ACTSRC             : 1;
    unsigned                    : 1;
    unsigned ACTUD              : 1;
    unsigned ACTEN              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned STOR               : 1;
    unsigned                    : 1;
    unsigned STLOCK             : 1;
    unsigned STSRC              : 1;
    unsigned                    : 1;
    unsigned STUD               : 1;
    unsigned STEN               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned ACTOR              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ACTD               : 1;
    unsigned ACTSEL             : 1;
    };
  } __ACTCONbits_t;

extern __at(0x0FB5) volatile __ACTCONbits_t ACTCONbits;

#define _ACTORS                 0x02
#define _STOR                   0x02
#define _ACTOR                  0x02
#define _ACTLOCK                0x08
#define _STLOCK                 0x08
#define _ACTSRC                 0x10
#define _STSRC                  0x10
#define _ACTUD                  0x40
#define _STUD                   0x40
#define _ACTD                   0x40
#define _ACTEN                  0x80
#define _STEN                   0x80
#define _ACTSEL                 0x80

//==============================================================================


//==============================================================================
//        STCON Bits

extern __at(0x0FB5) __sfr STCON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned ACTORS             : 1;
    unsigned                    : 1;
    unsigned ACTLOCK            : 1;
    unsigned ACTSRC             : 1;
    unsigned                    : 1;
    unsigned ACTUD              : 1;
    unsigned ACTEN              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned STOR               : 1;
    unsigned                    : 1;
    unsigned STLOCK             : 1;
    unsigned STSRC              : 1;
    unsigned                    : 1;
    unsigned STUD               : 1;
    unsigned STEN               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned ACTOR              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ACTD               : 1;
    unsigned ACTSEL             : 1;
    };
  } __STCONbits_t;

extern __at(0x0FB5) volatile __STCONbits_t STCONbits;

#define _STCON_ACTORS           0x02
#define _STCON_STOR             0x02
#define _STCON_ACTOR            0x02
#define _STCON_ACTLOCK          0x08
#define _STCON_STLOCK           0x08
#define _STCON_ACTSRC           0x10
#define _STCON_STSRC            0x10
#define _STCON_ACTUD            0x40
#define _STCON_STUD             0x40
#define _STCON_ACTD             0x40
#define _STCON_ACTEN            0x80
#define _STCON_STEN             0x80
#define _STCON_ACTSEL           0x80

//==============================================================================


//==============================================================================
//        ECCP1AS Bits

extern __at(0x0FB6) __sfr ECCP1AS;

typedef union
  {
  struct
    {
    unsigned PSS1BD0            : 1;
    unsigned PSS1BD1            : 1;
    unsigned PSS1AC0            : 1;
    unsigned PSS1AC1            : 1;
    unsigned ECCP1AS0           : 1;
    unsigned ECCP1AS1           : 1;
    unsigned ECCP1AS2           : 1;
    unsigned ECCP1ASE           : 1;
    };

  struct
    {
    unsigned PSSBD0             : 1;
    unsigned PSSBD1             : 1;
    unsigned PSSAC0             : 1;
    unsigned PSSAC1             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP1ASE            : 1;
    };

  struct
    {
    unsigned PSS1BD             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PSSBD              : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSS1AC             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSSAC              : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ECCP1AS            : 3;
    unsigned                    : 1;
    };
  } __ECCP1ASbits_t;

extern __at(0x0FB6) volatile __ECCP1ASbits_t ECCP1ASbits;

#define _PSS1BD0                0x01
#define _PSSBD0                 0x01
#define _PSS1BD1                0x02
#define _PSSBD1                 0x02
#define _PSS1AC0                0x04
#define _PSSAC0                 0x04
#define _PSS1AC1                0x08
#define _PSSAC1                 0x08
#define _ECCP1AS0               0x10
#define _ECCP1AS1               0x20
#define _ECCP1AS2               0x40
#define _ECCP1ASE               0x80
#define _CCP1ASE                0x80

//==============================================================================


//==============================================================================
//        ECCP1DEL Bits

extern __at(0x0FB7) __sfr ECCP1DEL;

typedef union
  {
  struct
    {
    unsigned PDC0               : 1;
    unsigned PDC1               : 1;
    unsigned PDC2               : 1;
    unsigned PDC3               : 1;
    unsigned PDC4               : 1;
    unsigned PDC5               : 1;
    unsigned PDC6               : 1;
    unsigned P1RSEN             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PR1SEN             : 1;
    };

  struct
    {
    unsigned PDC                : 7;
    unsigned                    : 1;
    };
  } __ECCP1DELbits_t;

