OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf24k50.h
#define _nPWRTEN_ON_2L          0xFE    // Power up timer enabled.
#define _nPWRTEN_OFF_2L         0xFF    // Power up timer disabled.
#define _BOREN_OFF_2L           0xF9    // BOR disabled in hardware (SBOREN is ignored).
#define _BOREN_ON_2L            0xFB    // BOR controlled by firmware (SBOREN is enabled).
#define _BOREN_NOSLP_2L         0xFD    // BOR enabled in hardware, disabled in Sleep mode (SBOREN is ignored).
#define _BOREN_SBORDIS_2L       0xFF    // BOR enabled in hardware (SBOREN is ignored).
#define _BORV_285_2L            0xE7    // BOR set to 2.85V nominal.
#define _BORV_250_2L            0xEF    // BOR set to 2.5V nominal.
#define _BORV_220_2L            0xF7    // BOR set to 2.2V nominal.
#define _BORV_190_2L            0xFF    // BOR set to 1.9V nominal.
#define _nLPBOR_ON_2L           0xBF    // Low-Power Brown-out Reset enabled.
#define _nLPBOR_OFF_2L          0xFF    // Low-Power Brown-out Reset disabled.

//----------------------------- CONFIG2H Options -------------------------------

#define _WDTEN_OFF_2H           0xFC    // WDT disabled in hardware (SWDTEN ignored).
#define _WDTEN_NOSLP_2H         0xFD    // WDT enabled in hardware, disabled in Sleep mode (SWDTEN ignored).
#define _WDTEN_SWON_2H          0xFE    // WDT controlled by firmware (SWDTEN enabled).
#define _WDTEN_ON_2H            0xFF    // WDT enabled in hardware (SWDTEN ignored).
#define _WDTPS_1_2H             0xC3    // 1:1.
#define _WDTPS_2_2H             0xC7    // 1:2.
#define _WDTPS_4_2H             0xCB    // 1:4.
#define _WDTPS_8_2H             0xCF    // 1:8.
#define _WDTPS_16_2H            0xD3    // 1:16.
#define _WDTPS_32_2H            0xD7    // 1:32.
#define _WDTPS_64_2H            0xDB    // 1:64.
#define _WDTPS_128_2H           0xDF    // 1:128.
#define _WDTPS_256_2H           0xE3    // 1:256.
#define _WDTPS_512_2H           0xE7    // 1:512.
#define _WDTPS_1024_2H          0xEB    // 1:1024.
#define _WDTPS_2048_2H          0xEF    // 1:2048.
#define _WDTPS_4096_2H          0xF3    // 1:4096.
#define _WDTPS_8192_2H          0xF7    // 1:8192.
#define _WDTPS_16384_2H         0xFB    // 1:16384.
#define _WDTPS_32768_2H         0xFF    // 1:32768.

//----------------------------- CONFIG3H Options -------------------------------

#define _CCP2MX_RB3_3H          0xFE    // CCP2 input/output is multiplexed with RB3.
#define _CCP2MX_RC1_3H          0xFF    // CCP2 input/output is multiplexed with RC1.
#define _PBADEN_OFF_3H          0xFD    // PORTB<5:0> pins are configured as digital I/O on Reset.
#define _PBADEN_ON_3H           0xFF    // PORTB<5:0> pins are configured as analog input channels on Reset.
#define _T3CMX_RB5_3H           0xEF    // T3CKI function is on RB5.
#define _T3CMX_RC0_3H           0xFF    // T3CKI function is on RC0.
#define _SDOMX_RC7_3H           0xBF    // SDO function is on RC7.
#define _SDOMX_RB3_3H           0xFF    // SDO function is on RB3.
#define _MCLRE_OFF_3H           0x7F    // RE3 input pin enabled; external MCLR disabled.
#define _MCLRE_ON_3H            0xFF    // MCLR pin enabled; RE3 input disabled.

//----------------------------- CONFIG4L Options -------------------------------

#define _STVREN_OFF_4L          0xFE    // Stack full/underflow will not cause Reset.
#define _STVREN_ON_4L           0xFF    // Stack full/underflow will cause Reset.
#define _LVP_OFF_4L             0xFB    // Single-Supply ICSP disabled.
#define _LVP_ON_4L              0xFF    // Single-Supply ICSP enabled if MCLRE is also 1.
#define _ICPRT_OFF_4L           0xDF    // ICPORT disabled.
#define _XINST_OFF_4L           0xBF    // Instruction set extension and Indexed Addressing mode disabled.
#define _XINST_ON_4L            0xFF    // Instruction set extension and Indexed Addressing mode enabled.
#define _DEBUG_ON_4L            0x7F    // Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug.
#define _DEBUG_OFF_4L           0xFF    // Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins.

//----------------------------- CONFIG5L Options -------------------------------

#define _CP0_ON_5L              0xFE    // Block 0 is code-protected.
#define _CP0_OFF_5L             0xFF    // Block 0 is not code-protected.
#define _CP1_ON_5L              0xFD    // Block 1 is code-protected.
#define _CP1_OFF_5L             0xFF    // Block 1 is not code-protected.

//----------------------------- CONFIG5H Options -------------------------------

#define _CPB_ON_5H              0xBF    // Boot block is code-protected.
#define _CPB_OFF_5H             0xFF    // Boot block is not code-protected.
#define _CPD_ON_5H              0x7F    // Data EEPROM is code-protected.
#define _CPD_OFF_5H             0xFF    // Data EEPROM is not code-protected.

//----------------------------- CONFIG6L Options -------------------------------

#define _WRT0_ON_6L             0xFE    // Block 0 (0800-1FFFh) is write-protected.
#define _WRT0_OFF_6L            0xFF    // Block 0 (0800-1FFFh) is not write-protected.
#define _WRT1_ON_6L             0xFD    // Block 1 (2000-3FFFh) is write-protected.
#define _WRT1_OFF_6L            0xFF    // Block 1 (2000-3FFFh) is not write-protected.

//----------------------------- CONFIG6H Options -------------------------------

#define _WRTC_ON_6H             0xDF    // Configuration registers (300000-3000FFh) are write-protected.
#define _WRTC_OFF_6H            0xFF    // Configuration registers (300000-3000FFh) are not write-protected.
#define _WRTB_ON_6H             0xBF    // Boot block (0000-7FFh) is write-protected.
#define _WRTB_OFF_6H            0xFF    // Boot block (0000-7FFh) is not write-protected.
#define _WRTD_ON_6H             0x7F    // Data EEPROM is write-protected.
#define _WRTD_OFF_6H            0xFF    // Data EEPROM is not write-protected.

//----------------------------- CONFIG7L Options -------------------------------

#define _EBTR0_ON_7L            0xFE    // Block 0 is protected from table reads executed in other blocks.
#define _EBTR0_OFF_7L           0xFF    // Block 0 is not protected from table reads executed in other blocks.
#define _EBTR1_ON_7L            0xFD    // Block 1 is protected from table reads executed in other blocks.
#define _EBTR1_OFF_7L           0xFF    // Block 1 is not protected from table reads executed in other blocks.

//----------------------------- CONFIG7H Options -------------------------------

#define _EBTRB_ON_7H            0xBF    // Boot block is protected from table reads executed in other blocks.
#define _EBTRB_OFF_7H           0xFF    // Boot block is not protected from table reads executed in other blocks.

//==============================================================================

#define __DEVID1                0x3FFFFE
#define __DEVID2                0x3FFFFF

#define __IDLOC0                0x200000
#define __IDLOC1                0x200001
#define __IDLOC2                0x200002
#define __IDLOC3                0x200003
#define __IDLOC4                0x200004
#define __IDLOC5                0x200005
#define __IDLOC6                0x200006
#define __IDLOC7                0x200007

#endif // #ifndef __PIC18LF24K50_H__
